semestr1/logika/21.10.20-c.md

# Table of Contents

1.  [zdania analityczne](#org1bb0fb8)
2.  [zdania kontradyktoryczne](#orgfcb9866)
3.  [zdania syntetyczne](#org7ba7a80)
4.  [zdania które nie są zdaniami w KRZ:](#org3a5b801)

-   logika dwuwartościowa
-   wartość logiczna zdania jest obiektywna


<a id="org1bb0fb8"></a>

# zdania analityczne

-   zdanie prawdziwe na mocy swej struktury i znaczenia występujacych w nim wyrażeń
-   o prawdziwości tego zdania przesądza sam sens u zytych w nim słów


<a id="orgfcb9866"></a>

# zdania kontradyktoryczne

-   zdania fałszywe na mocy swej struktury i sensu wytępujacych w nim wyrażeń


<a id="org7ba7a80"></a>

# zdania syntetyczne

-   zdanie, którego stwierdzenie prawdziwości lub fałszywosci wymaga kontajtu z rzeczywistoscią

wypowiedż zdaniowa niezupełna pełni funkcję zdania logicznego
o ile słuchacz zdaje sobie sprawę z domyślnych uzupełnień wypowiedzi pominiętych przez mówiącego
KRZ := klasyczny rachunek zdań

elementarną jednostką w KRZ jest całe zdanie

zdanie w KRZ := zdanie oznajmujące, opisujące rzeczywistość


<a id="org3a5b801"></a>

# zdania które nie są zdaniami w KRZ:

-   zdania wartościujące
-   zdania normatywne
-   zdania nieprecyzyjne
-   pytajniki i wykrzyknienia

O prawdziwosci lub fałszywości zdania mówimy wtedy i tylko wtedy gdy jes zgodne lub niezgodne z rzeczywstoscią.

symbolami zdań prostych są zmienne zdaniowe: p, q, r &#x2026;

Zmienne zdaniowe sa połączone spójnikami logicznymi(stałymi logicznymi).

Stałe logiczne są stałe(!sic).

